{
  "traits": [
    {
     
      "addPrice": 125,
      "removePrice": 1,
      "name": "Fastadaptation",
      "description": "Gain an additional stacking +10% chance to hit with each attack that misses an opponent. Bonus is reset upon landing a hit. Note: For the purposes of a reset on ranged attacks, hitting terrain blocking the target or a scattered shot counts as a hit and will reset the counter." 
    },
    {
      "addPrice": 75,
      "removePrice": 1,
      "name": "Cripplingstrikes",
      "description": "Lowers the threshold to inflict injuries by 33% for both melee and ranged attacks. Note: some enemies are immune to injuries or have very large health pool that protects them from receiving injuries."
 },
    {
      "addPrice": 150,
      "removePrice": 1,
      "name": "Colossus",
      "description": "Hitpoints are increased by 25%, which also reduces the chance to sustain debilitating injuries when being hit. Note: the bonus is always retroactively updated with maximum Hitpoints" 
 },
    {
      "addPrice": 100,
      "removePrice": 1,
      "name": "Ninelives",
      "description": "Once per battle, upon receiving a killing blow, survive with a few Hitpoints left and receive +15 Melee Defense, +15 Ranged Defense, +15 Resolve,+15 Initiative until your next turn. All damage over time status effects (bleed, poison, etc) are removed. Note: Hitpoints gained are a random number between 5-10." 
 },
    {
      "addPrice": 100,
      "removePrice": 1,
      "name": "Bagsandbelts",
      "description": "Unlock two extra bag slots to carry all your favorite things. Items placed in bags no longer give a penalty to Maximum Fatigue, except for two-handed weapons." 
 },
    {
      "addPrice": 80,
      "removePrice": 1,
      "name": "Pathfinder",
      "description": "Learn to move on difficult terrain. Action Point costs for movement on all terrain is reduced by -1 to a minimum of 2 Action Points per tile, and Fatigue cost is reduced to half. Changing height levels has no additional Action Point cost anymore, but Fatigue cost is unaffected." 
 },
    {
      "addPrice": 110,
      "removePrice": 1,
      "name": "Adrenaline",
      "description": "Unlocks the Perk  Adrenaline skill (costs 1 Action Point and 20 Fatigue) which puts you first in the turn order for the next round, to have another turn before your enemies do. Note: if two characters are using Perk Adrenaline, the one with the highest Initiative will act first." 
 },
    {
      "addPrice": 100,
      "removePrice": 1,
      "name": "Recover",
      "description": "Unlocks the Recover skill which allows for resting a turn (costs 9 Action Points) in order to reduce accumulated Fatigue by 50%." 
 },
    {
      "addPrice": 130,
      "removePrice": 1,
      "name": "Student",
      "description": "Gain additional 20% Experience from battle. At the eleventh character level, you gain an additional perk point and this perk becomes inert." 
 },
    {
      "addPrice": 125,
      "removePrice": 2,
      "name": "Executioner",
      "description": "Inflict additional 20% Damage against targets that have sustained any injury effects, like a broken arm."
},
    {
      "addPrice": 135,
      "removePrice": 2,
      "name": "Bullseye",
      "description": "The penalty to hit chance when shooting at a target that has no clear line of fire is reduced from 75% to 50% for ranged weapons. Note: this affects an initial, separate, hidden roll which determines whether the shot hits the intended target, and only applies when the intended target has cover. See Combat Mechanics and Hit Chance for further details."  
},
    {
      "addPrice": 200,
      "removePrice": 2,
      "name": "Dodge",
      "description": "Gain 15% of the character's current Initiative as a bonus to Melee and Ranged Defense." 
 },
    {
      "addPrice": 110,
      "removePrice": 2,
      "name": "Fortifiedmind",
      "description": "Resolve is increased by 25%. Note: the bonus is always retroactively updated with maximum Resolve." 
 },
    {
      "addPrice": 160,
      "removePrice": 2,
      "name": "Resilient",
      "description": "Any negative status effect with a finite duration (e.g. Bleeding, Charmed) has its duration reduced to 1 turn. Status effects that have their effects grow weaker over several turns (e.g. Goblin Poison) are at their weakest state from the start." 
 },
    {
      "addPrice": 175,
      "removePrice": 2,
      "name": "Steelbrow",
      "description": "Hits to the head no longer cause critical damage to this character, which also lowers the risk of sustaining debilitating head injuries. Note: Steel Brow negates the additional damage provided by Brute or Chop." 
 },
    {
      "addPrice": 150,
      "removePrice": 2,
      "name": "Quickhands",
      "description": "Swapping any item in battle except for shields becomes a free action with no Action Point cost once every turn. Note: This perk doesn't extend its effect for any actions with shields." 
 },
    {
      "addPrice": 110,
      "removePrice": 2,
      "name": "Gifted",
      "description": "Instantly gain a levelup to increase this character's attributes with maximum rolls but without talents."
 },
    {
      "addPrice": 175,
      "removePrice": 3,
      "name": "Backstabber",
      "description": "The bonus to hitchance in melee is doubled to +10% for each ally (including your Hounds) surrounding and distracting your target. Note: surrounding starts when two allies are adjacent to an enemy"
 },
    {
      "addPrice": 200,
      "removePrice": 3,
      "name": "Anticipation",
      "description": "When being attacked with ranged weapons, gain 1 + 10% of your base Ranged Defense as additional Ranged Defense per tile that the attacker is away, bonus is minimum +10 Ranged Defense."   

 },
    {
      "addPrice": 175,
      "removePrice": 3,
      "name": "Shieldexpert",
      "description": "The shield defense bonus is increased by 25%. This also applies to the additional defense bonus of the Shieldwall skill.Shield damage received is reduced by 50% to a minimum of 1. The 'Knock Back' skill gains +15% chance to hit."   

 },
    {
      "addPrice": 150,
      "removePrice": 3,
      "name": "Brawny",
      "description": "The Fatigue and Initiative penalty from wearing armor and helmet is reduced by 30%."   

 },
    {
      "addPrice": 150,
      "removePrice": 3,
      "name": "Relentless",
      "description": "At all times your Initiative is reduced only by 50% of your accumulated Fatigue, instead of all of it. Using the 'Wait' command no longer gives you a −25% penalty to Initiative when determining the turn order on the next round."   

 },
    {
      "addPrice": 175,
      "removePrice": 3,
      "name": "Rotation",
      "description": "Unlocks the 'Rotation' skill (costs 3 Action Points and 25 Fatigue) which allows two characters to switch places while ignoring Zone of Control as long as neither character is stunned, rooted or otherwise disabled."   

 },
    {
      "addPrice": 125,
      "removePrice": 3,
      "name": "Rallythetroops",
      "description": "Unlocks the 'Rally' skill (costs 5 Action Points and 25 Fatigue) which can rally fleeing allies, and raise morale of all nearby allies to a steady level. The higher the Resolve of the character using the skill, the higher the chance to succeed. Note: Rally triggers a morale check to raise morale of any ally at Wavering or worse morale within 4 tiles; with a bonus of 40% of the skill user's Resolve, and a penalty of -10 per tile of distance, to the roll. It can also rally fleeing allies within the same range at no penalty. Character attracts moderately more attention from enemies."   
 },
    {
      "addPrice": 125,
      "removePrice": 3,
      "name": "Taunt",
      "description": "Unlocks the 'Taunt' skill (costs 4 Action Points and 15 Fatigue) which makes the targeted opponent take offensive actions instead of defensive ones, and attack the taunting character over another, potentially more vulnerable one. Note: this only works if the taunted enemy is able to engage the taunted character, ranged or melee. And will be ignored if there is no unobstructed path. Character attracts more attention from enemies, higher Resolve gives more attraction."   
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Macemastery",
      "description": "Skills build up 25% less Fatigue. Knock Out, Knock Over and Strike Down have a 100% (+25%) chance to stun the target if not immune. The Polemace no longer has a penalty for attacking targets directly adjacent."
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Flailmastery",
      "description": "Skills build up 25% less Fatigue. Lash and Hail ignores the defense bonus of shield. Thresh gains +5% chance to hit."  
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Hammermastery",
      "description": "Skills build up 25% less Fatigue. Destroy Armor and Demolish Armor inflicts 33% more damage against armor. Shatter gains +5% chance to hit. The Polehammer no longer has a penalty for attacking targets directly adjacent."  
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Axemastery",
      "description": "Skills build up 25% less Fatigue. Split Shield damage to shields is increased by 50% when used with axes. Round Swing gains +5% chance to hit. The Longaxe no longer has a penalty for attacking targets directly adjacent."  
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Cleavermastery",
      "description": "Skills build up 25% less Fatigue. Bleeding damage inflicted by cleavers and whips is doubled to 10 and 20 per turn, respectively. Disarm penalty to hit is reduced to -10%."  
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Swordmastery",
      "description": "Skills build up 25% less Fatigue. Riposte no longer has a penalty to hitchance. Split and Swing gain a +5% chance to hit. Gash has 50% lower threshold to inflict injuries (up from 33%)."  
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Daggermastery",
      "description": "Skills build up 25% less Fatigue. Stab, Puncture and Deathblow have a reduced Action Point cost (3 AP from 4) to allow for an additional attack each turn."  
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Polearmmastery",
      "description": "Skills build up 25% less Fatigue. Polearm skills have their action point cost reduced to 5, and no longer have a penalty for attacking targets directly adjacent."  
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Spearmastery",
      "description":"Skills build up 25% less Fatigue. Spearwall is no longer disabled once an opponent manages to overcome it. Instead, Spearwall continues to give free attacks on any further opponent attempting to enter the zone of control. Spearwall can be activated when being already adjacent to opponents. The Spetum and Warfork no longer have a penalty for attacking targets directly adjacent."  
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Crossbowmastery",
      "description":"Skills build up 25% less Fatigue. An additional 20% of damage inflicted with crossbows ignores armor. Handgusnow require 6 Action Points to reload and can be fired every turn instead of every other turn."  
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Bowmastery",
      "description": "Skills build up 25% less Fatigue. View range and maximum firing range with bows is increased by 1."   
 },
    {
      "addPrice": 200,
      "removePrice": 4,
      "name": "Throwingmastery",
      "description": "Skills build up 25% less Fatigue. Damage is increased by 40% when attacking at 2 tiles of distance. Damage is increased by 20% when attacking at 3 tiles of distance."
 },
    {
      "addPrice": 200,
      "removePrice": 5,
      "name": "Reachadvantage",
      "description": "Each hit with a two-handed melee weapon adds a stack of Reach Advantage that increases your Melee Defense by 5, up to a maximum of 5 stacks, until this character's next turn. A single attack hitting multiple targets can add several stacks at once. If you put away your weapon, you lose all stacks."
 },
    {
      "addPrice": 250,
      "removePrice": 5,
      "name": "Overwhelm",
      "description": "Learn to take advantage of your high Initiative and prevent the enemy from attacking effectively by overwhelming them with your attacks! With every attack, hit or miss, against an opponent that acts after you in the current round, inflict the 'Overwhelmed' status effect which lowers both Melee Skill and Ranged Skill by 10% for one turn. The effect stacks with each attack, and can be applied to multiple targets at once with a single attack."  
 },
    {
      "addPrice": 200,
      "removePrice": 5,
      "name": "Lonewolf",
      "description": "I work best alone. With no ally within 3 tiles of distance, gain a 15% bonus to Melee Skill, Ranged Skill, Melee Defense, Ranged Defense, and Resolve."  
 },
    {
      "addPrice": 185,
      "removePrice": 5,
      "name": "Underdog",
      "description": "The defense malus due to being surrounded by opponents no longer applies to this character. If an attacker has the Backstabber perk, the effect of that perk is negated, and the normal defense malus due to being surrounded is applied instead."  
 },
    {
      "addPrice": 225,
      "removePrice": 5,
      "name": "Footwork",
      "description": "Unlocks the 'Footwork' skill (costs 3 Action Points and 25 Fatigue) which allows you to leave a Zone of Control without triggering free attacks by using skillful footwork."  
 },
    {
      "addPrice": 250,
      "removePrice": 6,
      "name": "Berserk",
      "description": "Once per turn, upon killing an enemy, 4 Action Points are immediately regained. Characters can not regain more than their maximum Action Points and no more than 4 for a single attack. The character attracts slightly more attention from opponents."
 },
    {
      "addPrice": 275,
      "removePrice": 6,
      "name": "Headhunter",
      "description": "Hitting the head of a target will give you a guaranteed hit to the head also with your next attack. Connecting with your hit, or missing with your attack, will reset the effect."       

 },
    {
      "addPrice": 250,
      "removePrice": 6,
      "name": "Nimble",
      "description": "Specialize in light armor! Hitpoint damage taken is reduced by up to 60%, but lowered exponentially by the total penalty to Maximum Fatigue from body and head armor above 15. The lighter your armor and helmet, the more you benefit. Perk Brawny does not affect this perk. Does not affect damage from mental attacks or status effects."       

 },
    {
      "addPrice": 250,
      "removePrice": 6,
      "name": "Battleforged",
      "description": "Specialize in heavy armor! Armor damage taken is reduced by a percentage equal to 5% of the current total armor value of both body and head armor. The heavier your armor and helmet, the more you benefit. Does not affect damage from mental attacks or status effects."       

 },
    {
      "addPrice": 300,
      "removePrice": 7,
      "name": "Fearsome",
      "description": "Make them scatter and flee! Any attack that inflicts at least 1 point of damage to hitpoints triggers a morale check for the opponent with a penalty equal to 20% of your Resolve, as opposed to with no penalty and only if at or above 15 points of damage. Note: only triggers once per target for a same skill use. Bonus from Resolve is capped at 20."
 },
    {
      "addPrice": 300,
      "removePrice": 7,
      "name": "Duelist",
      "description": "With the offhand free or carrying a throwable tool (e.g. a throwing net), an additional +25% of any damage ignores armor. Does not work with two-handed weapons."  
 },
    {
      "addPrice": 300,
      "removePrice": 7,
      "name": "Killingfrenzy",
      "description": "A kill increases all damage by 25% for 2 turns. Does not stack, but another kill will reset the timer. The character attracts more attention from opponents. Note: the timer starts on the turn it activates, meaning that the buff will expire on the end of the character's next turn."  
 },
    {
      "addPrice": 300,
      "removePrice": 7,
      "name": "Indomitable",
      "description": "Unlocks the 'Indomitable' skill (costs 5 Action Points and 25 Fatigue) which grants a 50% damage reduction and immunity to being stunned, knocked back or grabbed for one turn. The character attracts less attention from opponents."         
       
       }
  ],
  "total": 50
}
